"""
Задание №3
✔ Продолжаем развивать задачу 2.
✔ Возьмите словарь, который вы получили.
Сохраните его итераторатор.
✔ Далее выведите первые 5 пар ключ-значение,
обращаясь к итератору, а не к словарю.
"""


dct_iter = iter({i: ord(i) for i in input('введите text:> ')}.items())

for i in range(5):
    print(next(dct_iter))