"""
Задание №5
✔ Напишите программу, которая решает
квадратные уравнения даже если
дискриминант отрицательный.
✔ Используйте комплексные числа
для извлечения квадратного корня.
"""

"""
Комплексное число — это выражение вида a + bi, где a, b — действительные числа,
 а i — так называемая мнимая единица, символ, квадрат которого равен –1, 
 то есть i2 = –1. Число a называется действительной частью, 
 а число b — мнимой частью комплексного числа z = a + bi
"""

a = 5
b = -10
c = -400


d = b ** 2 - 4 * a * c
if d < 0:
    print(f"Дискриминант {d} меньше 0, корней нет")
elif d == 0:
    x = -b / (2 * a)
    print(f"Дискриминант: {d}; x = {x}")
else:
    x1 = (-b + d ** (1 / 2)) / (2 * a)
    x2 = (-b - d ** (1 / 2)) / (2 * a)
    print(f"Дискриминант: {d}; x1 = {x1}; x2 = {x2}")